###############################
#  Taps                       #
###############################

tap "AdoptOpenJDK/openjdk"
tap "appveyor/brew"
tap "aws/tap"
tap "caskroom/cask"
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
# tap "exolnet/deprecated"
tap "facebook/fb"
tap "github/bootstrap"
tap "github/gh"
tap "goreleaser/tap"
tap "heroku/brew"
tap "hhvm/hhvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
# tap "jakejarvis/brew", "git@github.com:jakejarvis/homebrew-brew.git"
tap "mongodb/brew"
tap "sass/sass"
tap "teamookla/speedtest"
tap "thoughtbot/formulae"
tap "twilio/brew"
# tap "wpengine/wpe-cli"

###############################
#  Binaries                   #
###############################

# Perhaps most importantly...
brew "zsh"

# Better bash as a backup
brew "bash"
brew "bash-completion"

# GNU utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnutls"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"

# wget with IRI support
brew "wget", args: ["with-iri"]

# GnuPG to enable PGP-signing commits
brew "gnupg"

# More recent versions of some macOS tools
brew "vim"  #, args: ["with-override-system-vi"]
brew "gcc"
brew "grep"
brew "make"
brew "openssh"
brew "screen"
brew "gmp"

# Other useful binaries
brew "ack"
brew "gs"
brew "imagemagick", args: ["with-webp"]
brew "ffmpeg", args: ["with-libvpx"]
brew "gawk"
brew "less"
brew "lua"
brew "lynx"
brew "mtr"
brew "nano"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id", link: true
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "the_silver_searcher"

# Git
brew "git"
brew "git-lfs"
brew "git-crypt"
brew "hub"
brew "github/gh/gh"

# Node & NPM / NVM
brew "node"
brew "nvm"

# Mostly ordinary binaries
brew "amazon-ecs-cli"
brew "aws/tap/aws-sam-cli"
brew "aws-shell"
brew "awscli"
brew "angular-cli"
brew "asciinema"
brew "azure-cli"
brew "caddy"
brew "carthage"
brew "cli53"
brew "cloudflare/cloudflare/cloudflared"
brew "cocoapods"
brew "composer"
brew "dnsmasq"
brew "doctl"
brew "elixir"
brew "erlang"
brew "facebook/fb/fbsimctl", args: ["HEAD"]
brew "geoip"
brew "go"
brew "goreleaser/tap/goreleaser"
brew "govendor"
brew "guetzli"
brew "heroku/brew/heroku-node"
brew "heroku/brew/heroku"
brew "hhvm"
brew "htop"
brew "httpie"
brew "httrack"
brew "hydra"
brew "iproute2mac"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "libsass", args: ["HEAD"]
brew "mas"
brew "mcrypt"
brew "mhash"
brew "mkcert"
# brew "mongodb"
brew "mongodb/brew/mongodb-community"
brew "mosh"
brew "mysql"
brew "mysql-client"
brew "ncurses"
brew "neofetch"
brew "netcat"
brew "openvpn"
brew "optipng"
brew "packer"
brew "thoughtbot/formulae/parity"
brew "php"         # = php@7.3   https://formulae.brew.sh/formula/php
# brew "php@7.1"
# brew "php@7.2"
# brew "jakejarvis/brew/php@5.6"
# brew "exolnet/deprecated/php@5.6"
# brew "exolnet/deprecated/php@7.0"
brew "pngcheck"
brew "pngcrush"
brew "postgresql"
brew "python"
brew "python@2"
brew "pyenv"
brew "ruby"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "s3fs"
brew "sass/sass/migrator"
brew "sass/sass/sass"
brew "serverless"
brew "shellcheck"
brew "speedtest-cli"
brew "sqlite"
brew "sub2srt"
brew "teamookla/speedtest/speedtest"
brew "terraform"
brew "thoughtbot/formulae/parity"
brew "tor"
brew "torsocks"
brew "travis"
brew "twilio/brew/twilio"
brew "typescript"
brew "unrar"
brew "watchman"
brew "whois", link: true
brew "wireguard-tools"
brew "wireguard-go"
brew "wp-cli"
# brew "wpengine/wpe-cli/wpe-cli"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "yuicompressor"
brew "zopfli"

# Android SDK
brew "ant"
brew "maven"
brew "gradle"
cask "android-sdk"
# cask "android-ndk"
cask "android-platform-tools"

# Pentesting tools
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pdfcrack"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "xpdf"
brew "bettercap"
brew "hashcat"
brew "nikto"
brew "tcpdump"

###############################
#  macOS Apps via Cask        #
###############################

cask_args appdir: "/Applications"

# System Utilities
cask "osxfuse"
cask "appzapper"
cask "backblaze"
cask "backblaze-downloader"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "coconutbattery"
cask "daisydisk"
cask "duet"
cask "endurance"
cask "etrecheckpro"
cask "filebot"
cask "geekbench"
cask "intel-power-gadget"
cask "istat-menus"
cask "paragon-ntfs"
cask "the-unarchiver"
cask "transmission"
cask "unetbootin"
cask "unshaky"
cask "vnc-viewer"

# Passwords, VPNs, other Security
cask "1password"
cask "authy"
cask "expressvpn"
cask "gpg-suite"
# cask "gpg-suite-no-mail"     # Install Mail separately: https://github.com/GpgMailNoActivation/GpgMailNoActivation
# cask "jakejarvis/brew/gpg-suite-no-drm"      # personal cask to install GPG suite and mail.app plugin without activation
cask "keybase"
cask "little-snitch"
cask "nordvpn"
cask "tor-browser"
cask "tunnelblick"

# Development/Work
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "chromedriver"
cask "eclipse-java"
cask "filezilla"
cask "github"
cask "glyphs"
cask "google-cloud-sdk"
cask "imageoptim"
cask "iterm2"
# cask "java8"
cask "jetbrains-toolbox"
cask "mamp"
cask "microsoft-office"
cask "multipass"
cask "ngrok"
cask "postman"
cask "powershell"
cask "robo-3t"
cask "sequel-pro"
cask "sketch"
cask "tower"
cask "transmit"
cask "visual-studio-code"
cask "visual-studio"
cask "xquartz"

# Virtual Machines (& Docker)
cask "docker"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vmware-fusion"

# Media
cask "beamer"
cask "handbrake"
cask "iina"
cask "plex-media-player"
cask "pocket-casts"
cask "spotify"
cask "vlc"

# Communication/Social
cask "discord"
cask "skype"
cask "slack"
cask "whatsapp"
cask "zoomus"

# Gaming
cask "shadow"
cask "steam"
cask "minecraft"
cask "nvidia-geforce-now"

# Pentesting
cask "burp-suite"
cask "charles"
cask "metasploit"
cask "wifi-explorer"
cask "wireshark"

# Browsers (for reference only -- install these via offline DMGs no matter what)
# * Firefox
#    - Stable
#    - Dev: https://www.mozilla.org/en-US/firefox/developer/
#    - Nightly: https://www.mozilla.org/en-US/firefox/channel/desktop/
# * Chrome
#    - Stable
#    - Canary: https://www.google.com/chrome/canary/
# * Safari
#    - Preview: https://developer.apple.com/safari/technology-preview/

###############################
#  macOS Apps via App Store   #
###############################

# Apple
mas "Apple Configurator 2", id: 1037126344
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro X", id: 634148309
mas "MainStage 3", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# Third Party
mas "Amphetamine", id: 937984704
mas "Disk Speed Test", id: 425264550
mas "Microsoft Remote Desktop", id: 1295203466
mas "Outline", id: 1356178125
mas "Shazam", id: 897118787
mas "TweetDeck", id: 485812721
mas "Twitter", id: 409789998
mas "WireGuard", id: 1451685025
mas "Wunderlist", id: 410628904
