tap "1password/tap"
tap "anomalyco/tap"
tap "ngrok/ngrok"
brew "autoconf"
brew "bash"
brew "bat"
brew "xz"
brew "btop"
brew "chezmoi"
brew "cloc"
brew "cloudflared"
brew "cocoapods"
brew "container"
brew "gmp"
brew "coreutils"
brew "libnghttp2"
brew "curl", link: true
brew "jpeg-turbo"
brew "sqlite"
brew "deno"
brew "eza"
brew "fastlane"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "mpfr"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "p11-kit"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "make"
brew "mas"
brew "mise"
brew "mole"
brew "mtr"
brew "nano"
brew "openssh"
brew "pkgconf"
brew "qemu"
brew "ripgrep"
brew "screen"
brew "ssh-copy-id", link: true
brew "starship"
brew "swiftlint"
brew "tailscale"
brew "telnet"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unzip", link: true
brew "wakatime-cli"
brew "watchman"
brew "wget"
brew "whois", link: true
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
cask "1password"
cask "1password-cli"
cask "affinity"
cask "android-studio"
cask "antigravity"
cask "appcleaner"
cask "backblaze"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "chatgpt"
cask "claude"
cask "cleanmymac"
cask "coconutbattery"
cask "codex"
cask "codex-app"
cask "copilot-cli"
cask "cursor"
cask "discord"
cask "dropbox"
cask "epic-games"
cask "expo-orbit"
cask "figma"
cask "firefox"
cask "font-cascadia-code"
cask "font-comic-neue"
cask "font-geist"
cask "font-geist-mono"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-inter"
cask "font-monaspace"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "gcloud-cli"
cask "geekbench"
cask "ghostty"
cask "gimp"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake-app"
cask "helium-browser"
cask "icon-composer"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "little-snitch"
cask "mullvad-vpn"
cask "ngrok"
cask "nvidia-geforce-now"
cask "obsidian"
cask "ollama-app"
cask "opencode-desktop"
cask "orbstack"
cask "parallels"
cask "pgadmin4"
cask "plex"
cask "postgres-app"
cask "postman"
cask "raindropio"
cask "raspberry-pi-imager"
cask "raycast"
cask "redis-insight"
cask "rustdesk"
cask "sf-symbols"
cask "shadow"
cask "spotify"
cask "steam"
cask "t3-code"
cask "tableplus"
cask "tg-pro"
cask "the-unarchiver"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
cask "transmit"
cask "tunnelblick"
cask "updatest"
cask "visual-studio-code"
cask "wifi-explorer"
cask "wifiman"
cask "wireshark-app"
cask "wordpresscom-studio"
cask "xquartz"
cask "yubico-authenticator"
cask "zed"
cask "zoom"
cask "zulu@17"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Brother iPrint&Scan", id: 1193539993
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 0
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hverlin.mise-vscode"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "vitest.explorer"
vscode "voidzero.vite-plus-extension-pack"
vscode "wakatime.vscode-wakatime"
